{"projects":[{"title":"StudyFind Blockchain Medical Record Saver","date":20211211,"thumbnail":"/images/projects/blockchain.png","dates":"January 2021 ~ December 2021","skills":["Solidity<br>NodeJS<br>ReactNative<br>Google Firestore"],"description":["This was an experimental project directed by StudyFind, a research organization from Emory University. It aims to introduce the usage of blockchain in the field of medication.<br>Our team designed and implemented an Android based application that enables fast, easy and secure management of medical data. The app stores medical records on the Ethereum network, and allows sharing across institutions on a request-approval basis. It also provides an interface for patients to directly manage their medical records and decide who has access to them.<br>My tasks during this project included architecture design, backend implementation, testing and deployment, and documentation writeup. The application is currently going through beta testing, if gains success it may be released to the mainstream market."],"link":"https://github.com/TekTroller/StudyFind#readme","importance":10},{"title":"Anime Face Generator","date":20220801,"thumbnail":"/images/projects/anime-face-generator.png","dates":"June 2022","skills":["Python<br>PyTorch<br>Jupyter Notebook"],"description":["A deep learning project to generate anime face images. For this project I built a GAN model in PyTorch with over 46 million parameters. In order to achieve stable training and high-quality outputs, the model was structured based on the <a href='https://arxiv.org/abs/1903.06048' target='_blank'>MSG (Multi-Scale Gradients)</a> architecture<br>My GPU is still working hard to train the networks, once it's done I will post more updates and provide more sample outputs."],"link":"https://github.com/jlu628/WaifuGenerator","importance":1},{"title":"One Week Couple Website","date":20220220,"thumbnail":"/images/projects/one-week-couple.png","dates":"November 2021 ~ Febuary 2022","skills":["HTML<br>CSS<br>JavaScript<br>NodeJS<br>AWS<br>Google Firestore"],"description":["A web application for the GTCSSA Valentines day special event. It intends to help single students find their significant partners. The website gathers participants' information and uses a matching algorithm to pair participants into couples. These couples would go on \"dating\" for a week and complete a list of tasks we have designed to get to know each other.<br>This year over 200 students signed up to this event, and more than 140 participants successfully paired up. Most participants found the event interesting and inspiring, and several pairs even end up forming a real relationship."],"link":"https://one-week-couple.gtcssa.org/","importance":1},{"title":"QiDian Smart Go Board","date":20210927,"thumbnail":"/images/projects/qidian.png","dates":"May 2021 ~ September 2021","skills":["Swift<br>Python<br>AWS"],"description":["QiDian Inc. is a Startup company under the CreateX program at Georgia Tech. For the Smart Go Ban project, the team built an iOS app that connects to a specially made Go board via bluetooth, which allows players to play online Go games in a physical form (since many chess players prefer looking at a physical chess board rather than a screen).<br>As the backend developer of the team, I built a server that integrates with Katago AI to support advanced functions such as play against AI, win-rate prediction and post game analysis."],"link":"https://qidiantechnology.com/","importance":1},{"title":"GTCSSA Website","date":20210311,"thumbnail":"/images/projects/gtcssa.png","dates":"November 2020 ~ March 2021","skills":["HTML<br>CSS<br>JavaScript"],"description":["The Georgia Tech's Chinese Student and Scholars' Association (GTCSSA) is a student organization that provides support to the local Chinese community. As the tech lead of the Department of Technology under the GTCSSA, I lead a team to develop websites and applications for the organization.<br>This official website serves as a freshman handbook for new students, and out team also plan to integrate other functions such as tutorial finding and second-hand trading platform. The website gained over 1000 views in the past year and is also available as a WeChat Applet."],"link":"https://gtcssa.org","importance":1},{"title":"Discord Bots","date":20201010,"thumbnail":"/images/projects/discordbots.png","dates":"Since October 2020","skills":["Python<br>AWS"],"description":["These are Discord bots I have created for my server. Written in Python using Discord API, and deployed to AWS. Each bot has distince functions, such as translating texts, or turn images into ASCII arts.<br>Feel free to invite one to your server and try them, for detailed instructions click on the demo button."],"link":"https://github.com/jlu628/DiscordBots#readme","importance":0}]}